{"meta":{"title":"gavelWeb","subtitle":"Web, SEO, Trends, Development","description":"Web development studio","author":"Igor Gavelyuk","url":"http://gavelweb.site"},"pages":[{"title":"About","date":"2018-06-04T16:39:10.000Z","updated":"2018-08-19T23:22:19.488Z","comments":true,"path":"About/index.html","permalink":"http://gavelweb.site/About/index.html","excerpt":"","text":"mr. Gavel WebHey and welcome on my blog, thanks for visiting about page! Full-stack web developer (I do not like to be full, it just happen xD) I am front-end dev with love of problem-solving. My strengths are Html/5, css/3, and vanilla JavaScript. My tech stack includes:JS- ES6, Vue, and vanillajQueryRESTHtml/5css/3 (Bootstrap Materialize Metro 4) I have experience with node.js, have written apps and created, fixed and maintained sites. I can assist at all levels from full development to deploy (I can upload to host and configure). I completed the freeCodeCamp front-end developer course and participated in hactoberfest 2017 (DigitalOcean hackathon) I like video editing"}],"posts":[{"title":"Instagram-TagItLikeIt","slug":"Instagram-TagItLikeIt","date":"2018-08-26T21:09:50.000Z","updated":"2018-08-26T21:57:23.414Z","comments":true,"path":"2018/08/27/Instagram-TagItLikeIt/","link":"","permalink":"http://gavelweb.site/2018/08/27/Instagram-TagItLikeIt/","excerpt":"Task - Improve subscriber value in InstagramEasiest wayThan more likes and posts you do, than more subscribers you have.Pretty simple, but what if you out of time?All sweet you need to read! xD","text":"Task - Improve subscriber value in InstagramEasiest wayThan more likes and posts you do, than more subscribers you have.Pretty simple, but what if you out of time?All sweet you need to read! xDIf you do not have time - Lets your notebook do it!As in previous times you need FirefoxInstall Grease Monkey ExtensionCopy paste scriptSearch for HASH TagActivate Grease MonkeyEnjoy!Give me Like give me Next give me Scrip to do it flexSo this is proper script but how it works?Switch ON donation Button and lets read.12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849// ==UserScript==// @name TagItLikeIt// @version 1// @grant none// ==/UserScript==var likes = 0; // initial likes set to 0var scrooltobottom = 200; //we will scrool bottom 200px// Just checking if page loaded an// Find this face it where program jump to start &lt;(O.O)&gt;window.addEventListener(&apos;DOMContentLoaded&apos;, function() &#123; console.log(&apos;window - DOMContentLoaded - bubble&apos;); // 3rdfunction simulateCliks(el, evntType)&#123; if (el.fireEvent) &#123; el.fireEvent(&apos;on&apos; + evntType); &#125; else &#123; var evObj = document.createEvent(&apos;Events&apos;); evObj.initEvent(evntType, true, false); el.dispatchEvent(evObj); &#125; likes++;&#125;// &lt;span class=&quot;glyphsSpriteHeart__filled__24__red_5 Szr5J&quot;&gt;Unlike&lt;/span&gt;// &lt;span class=&quot;glyphsSpriteHeart__outline__24__grey_9 Szr5J&quot;&gt;Like&lt;/span&gt;var greyHearts = []; // Array of unliked thingsvar likeButton = []; // Array of buttonsvar scrooltobottom =0;var fixedScrool = 1600; // scrool for 600 pxvar timerInt = 3000; // 6 sec// &lt;(O.O)&gt; starting here with timer setInterval(function()&#123; // Selecting all not &quot;Liked Hearts&quot; // So we will click &quot;Like&quot; and &quot;Next&quot; // Each time then pass simulateCliks function greyHearts = document.getElementsByClassName(&quot;glyphsSpriteHeart__outline__24__grey_9&quot;); simulateCliks(greyHearts[0].parentElement, &apos;click&apos;, likes);// Finding right buttons var xCom = document.getElementsByClassName(&quot;coreSpriteRightPaginationArrow&quot;); console.log(xCom[0]); simulateCliks(xCom[0], &apos;click&apos;, likes); // window.scrollTo(0,scrooltobottom); // scrooltobottom=scrooltobottom+fixedScrool; console.log(likes+&quot;-- likes for this session&quot;); // Ctrl+Shift+I // Find Console and see stats // Thats all folks &#125;, timerInt);&#125;);Pls Donate with your CPU powerLovely DonationDonateVideo Instructions","categories":[],"tags":[]},{"title":"15bs100ur","slug":"15bs100ur","date":"2018-08-21T09:05:07.000Z","updated":"2018-08-26T01:38:09.415Z","comments":true,"path":"2018/08/21/15bs100ur/","link":"","permalink":"http://gavelweb.site/2018/08/21/15bs100ur/","excerpt":"Most detailed review on Hewlett-Packard 15-bs100ur 15.6 inch Display/Монитор SVA 1920x1080 px CPU: Intel® Core™ i5-8250U (Kaby Lake R) Memory: DDR4-2400 SDRAM, 8 Гбайт Video: Intell UHD 620 and AMD Radeon™ 520 (2 Gb memory DDR3L) HDD: Toshiba 1 Tb, 5400 rev/min SATAII Web camera 720p No-DVD, do not have space for DVD Price: 520$ - 620$ Best segment to use: Work, Web development. Recommended OS: Windows10 Direct link to YouTube Watch on Youtube","text":"Most detailed review on Hewlett-Packard 15-bs100ur 15.6 inch Display/Монитор SVA 1920x1080 px CPU: Intel® Core™ i5-8250U (Kaby Lake R) Memory: DDR4-2400 SDRAM, 8 Гбайт Video: Intell UHD 620 and AMD Radeon™ 520 (2 Gb memory DDR3L) HDD: Toshiba 1 Tb, 5400 rev/min SATAII Web camera 720p No-DVD, do not have space for DVD Price: 520$ - 620$ Best segment to use: Work, Web development. Recommended OS: Windows10 Direct link to YouTube Watch on Youtube So basically we have very nice look (you can see on the pictures) General specsDisplay SVA TN full HD display 1920x1080 SPS 798933-011 CPU Intel® Core™ i5-8250U (Kaby Lake R) Cores 4, Treads 8 Frq: 1,60 GHz, Turbo Boost: 3,40 GHz Production date : Q3’17 Lithography : 14 nm Recommended price : $297.00 Motherboard HP CSL50 LS-E792P Manufacture in China Memory HP Capacity: 8192 Mb D/C 7J1830 SPS 820570-005 CT RGVNH Chips: 8AE75 D9VPP Quantity of chips: 4x2 Hard drive Toshiba 1TB 5200 rev/min Buffer: 8 Mb Quantity of heads: 4 Quantity blades: 2 Form factor: 2.5 inch (notebook) Wlan SPS 927230-855 Bt/Wlan combo Chip: RTL 8723DE Web camera Unknown 720p Average quality of shooting. As you can see only CPU cost almost more than half of the notebook. So actually you not need expect some miracles, but overall quality and build is actually very good for this segment and for price.Looks like you will not able to buy nothing with that specs for this price. My experienceWindowsI am web dev, and for me use of Windows 10 actually is not required and most of my working tools works much more better under Linux.Yes I am test this notebook on Windows 10 and unsupported Windows 7.And looks like it still possible to use Windows 7, you will have headache during driver installation but it possible.Windows 10 all works pretty fine, Windows 10 little bit heavy but works good.Wifi works from the box and other drivers works just fine. The Radeon 520 heating notebook as hell. LinuxIf you are using just as me for coding - this notebook best what I had try. The problems exist: No support for Radeon 520 from linux distribution (You can download from Ati website) Wifi not works from the box, but I this fix for 10 seconds + 1 min to read manuals) ModdingYou need SSD really for this CPU you need SSD, throw away 1tb Toshiba HDD and install something faster.Luck of lights on the keyboard, for me this is not very nice, yes I can live without it but back-light is handy. ConclusionIt nice piece of hardware, and mostly I like how it works under Linux, if you had problems with Wifi go here1https://github.com/smlinux/rtl8723de Kernell lower 4.10Read manuals but basicaly if you had kernel lower 4.10 you do this:123456sudo apt-get install git dkmsgit clone https://github.com/smlinux/rtl8723de.git -b 4.10-downsudo dkms add ./rtl8723desudo dkms install rtl8723de/5.1.1.8_21285.20171026_COEX20170111-1414sudo depmod -areboot Kernell 4.11 and upperRead manuals but basicaly if you had kernel lower 4.10 you do this:123456sudo apt-get install git dkmsgit clone https://github.com/smlinux/rtl8723de.git -b 4.11-upsudo dkms add ./rtl8723desudo dkms install rtl8723de/5.1.1.8_21285.20171026_COEX20170111-1414sudo depmod -areboot Kernell lower 4.15 and upperRead manuals but basicaly if you had kernel lower 4.10 you do this:123456sudo apt-get install git dkmsgit clone https://github.com/smlinux/rtl8723de.git -b 4.15-upsudo dkms add ./rtl8723desudo dkms install rtl8723de/5.1.1.8_21285.20171026_COEX20170111-1414sudo depmod -areboot Other pictures: Pls Donate with your CPU power Lovely Donation Donate","categories":[],"tags":[{"name":"15-bs100ur","slug":"15-bs100ur","permalink":"http://gavelweb.site/tags/15-bs100ur/"}]},{"title":"likelikelike-instagram","slug":"likelikelike-instagram","date":"2018-07-31T10:14:06.000Z","updated":"2018-08-19T23:22:19.488Z","comments":true,"path":"2018/07/31/likelikelike-instagram/","link":"","permalink":"http://gavelweb.site/2018/07/31/likelikelike-instagram/","excerpt":"My thousand Instagram subscribers. Here I would like to share my story about how I got 1000 subscribers. So let’s start hacking Instagram.","text":"My thousand Instagram subscribers. Here I would like to share my story about how I got 1000 subscribers. So let’s start hacking Instagram. So as a developer I’m install on my Firefox and onlyone extension called: grease Monkey. Idea was do automatic following and likes all of the content of my followers. This is little bit mmmm… a irresponsible because huge amount of people have just crazy content so if you likes in automatic mode you can miss pretty damn good people or like some people and content what you will never like. And after reading this post I will just remind you when you use any scripts you can be banned and nobody will help you also your account can be steeled.So basically you need dedicated computer, probably your old notebook with installed Firefox + grease monkey extension four Firefox. Basically you need just copy paste or download the script, but I would like you learn and not blind copy paste, I would like to teach you the basic principles all the web.So any element on your page have a classes for style (CSS) and IDs for a JavaScript so basically if you know any language related to Web you can do it.Lets start writing simulator of yourself. More or less we will have a small bot/script what likes user posts.So Instagram loading your browser with feed oWe need to find with JavaScript grey hearts they have CSS classes &quot;glyphsSpriteHeart__outline__24__grey_9&quot; so we took all elements and put in array after these we take first element of the array as you remember it will be element number zero and simulating event with click. For this we use document create event and after this we need event and dispatch it, later increase our counter and scroll manually page and do this again and again.Instagram have limitation on speed how you clicking and quantity of click (likes). so you’re not allowed click faster then 3 milliseconds and you do not allowed to do more than 1600 likes at least I’ve got problems then do around this number.Likes with speed of 3 milliseconds it will actually looks like somebody attack the server and of course when you do more than thousand likes in one hour it will looks very suspicious. So basically if you have limits on the cache you can do this trick to improve your Instagram stats. Second very important thing is following for other users.The script will work in same way you just need to choose “follow button” and do same checks do not click when you’re already following that user.Basically if you will work hard you can get around 300 new subscribers per day and this will be from the total value of your users 20% of all you following.In other words if you will be follow 5000 person 1000 person for sure will be subscribe to your channel, Of course from these thousand persons will be around 300 persons what have their own business and they do most likely the same what you doing. Natural subscribers it’s more good thing but you will gain them very very slow. You can choose some predefined path take music, almost nude girls, memes, but in this case you will lose your personality and for some people you personal style and work very important. People would like to see your face and know this person stay behind this advertisement and this person don’t scare to show his face and the name because he or she do not trick people, they would like to know about this person really like to do proper job. I would like to thanks to all my subscribers and hopefully you will read this text and and it will be improve your situation on Instagram platform and/or understanding how the web works.Please bookmark my blog page, here will be more interesting content, you will able to learn more about marketing, development, and other interesting stuff. Code of simple script as always in the end. you can donate with your CPU power and mine for me some Monero coins, by the way, you can register on the site and go to the Brotherhood of Eden, download the web app and install on your website, you can change credentials and use this handy beautiful cross platform, well tested donation button. See you soon, best regards. 12345678910111213141516171819202122232425262728293031323334// ==UserScript==// @name Likelikelike// @version 1// @grant none// ==/UserScript==var likes = 0;var scrooltobottom = 200;window.addEventListener('DOMContentLoaded', function() &#123; console.log('window - DOMContentLoaded - bubble'); // 3rdfunction simulateCliks(el, evntType)&#123; if (el.fireEvent) &#123; el.fireEvent('on' + evntType); &#125; else &#123; var evObj = document.createEvent('Events'); evObj.initEvent(evntType, true, false); el.dispatchEvent(evObj); &#125; likes++;&#125;// &lt;span class=\"glyphsSpriteHeart__filled__24__red_5 Szr5J\"&gt;Unlike&lt;/span&gt;// &lt;span class=\"glyphsSpriteHeart__outline__24__grey_9 Szr5J\"&gt;Like&lt;/span&gt;var greyHearts = []; // Array of unliked thingsvar likeButton = []; // Array of buttonsvar scrooltobottom =0;var fixedScrool = 600; // scrool for 600 pxvar timerInt = 6000; // 6 sec setInterval(function()&#123; greyHearts = document.getElementsByClassName(\"glyphsSpriteHeart__outline__24__grey_9\"); simulateCliks(greyHearts[0].parentElement, 'click', likes); window.scrollTo(0,scrooltobottom); scrooltobottom=scrooltobottom+fixedScrool; console.log(likes+\"-- likes for this session\"); &#125;, timerInt);&#125;);","categories":[],"tags":[]},{"title":"gavelweb","slug":"gavelweb-1","date":"2018-07-30T01:50:06.000Z","updated":"2018-08-19T23:22:19.488Z","comments":true,"path":"2018/07/30/gavelweb-1/","link":"","permalink":"http://gavelweb.site/2018/07/30/gavelweb-1/","excerpt":"Hello and good evening to all. So right now I’m pretty tired and I would like to share some information how you can create your beautiful blog posts do not type any word.","text":"Hello and good evening to all. So right now I’m pretty tired and I would like to share some information how you can create your beautiful blog posts do not type any word. For this reason I would like to use dictation.io so you will need to have the microphone and Google Chrome browser. Create a sentence in your mind push start button and spell you masterpiece. This method is extremely fast and extremely good. even if you deadly tired you can create posts for your favorite blog. Second article will be bout typing you blog. So there is a huge amount of operations systems the world and you can install this operations systems for any kind of computer and processor, Windows MacOS and Linux distribution in mainstream. most likely you use Windows 7 Windows 8.1 or Windows 10, I prefer using Linux Ubuntu mate, Linux Mint, Linux Ubuntu.If you starting write your blog you will need to write quick huge amount of letters. Of course you can learn this on blind typing games, but the most proper thing learn this during writing posts on your blog. For this reason I highly recommend you install on-screen keyboard for orientation of your fingers and some program to show pressed key, also handy to have error words highlighting. I use https://github.com/wavexx/screenkeyso screen key Unix/Linux/Mac/Windows program full screen cast your keyboard keys, you can use it even for YouTube streams!Have a good day, thats all for today!","categories":[],"tags":[{"name":"blog","slug":"blog","permalink":"http://gavelweb.site/tags/blog/"}]},{"title":"gavelweb","slug":"gavelweb","date":"2018-07-30T01:18:51.000Z","updated":"2018-08-19T23:22:19.488Z","comments":true,"path":"2018/07/30/gavelweb/","link":"","permalink":"http://gavelweb.site/2018/07/30/gavelweb/","excerpt":"Hello ladies and gentlemens, welcome on gavelWeb blog.Here you will find information about web development ( landing pages, blogs, e-commerce, payment gateways, donation tools), start-up creations steps and problems, marketing strategy, tools.","text":"Hello ladies and gentlemens, welcome on gavelWeb blog.Here you will find information about web development ( landing pages, blogs, e-commerce, payment gateways, donation tools), start-up creations steps and problems, marketing strategy, tools.The main theme of the blog is low end segment for creating your own business. I will share the tips how to choose proper landing pages, group of developers, hire group of people to maintain your websites.I would like open your eyes on some services like github, netify, N1, dictation.io ,codepen.io, Hexo and others static sites engines, also Wordpress and Drupal theme creation and administration. We will look on some services from creation, collaboration, deployment and you will learn the best ways to do things right. I’m also would like have a feedback.Stay with gavelWeb","categories":[],"tags":[{"name":"gavelweb","slug":"gavelweb","permalink":"http://gavelweb.site/tags/gavelweb/"}]}]}